<?php
$a = 0b111100>>(255&~252);
$char = chr($a);
echo $a;
echo $char;


// 0b111100 = 60
//~252 е битово отрицание на числото 252, което премахва 3-те най-младши бита и прави техните стойности обратни (т.е. 0 става 1 и обратно). Резултатът е 3, което е същото като бинарното представяне на 0b0011.
//255 & ~252 е побитово §§ между 255 и 3, което дава резултатът 3.
//>> Shift right
//Така че изразът 0b111100>>(255&~252) е еквивалентен на израза 0b111100>>3. Това означава, че ще изместим битовете на числото 0b111100 с 3 позиции надясно (вдясно от последните три бита) и ще получим резултатът 0b000111 или 7 в десетична бройна система.

?>