<?php
/*Създайте скрипт, който изчислява броя на дните между дадена дата и текущата дата и извежда резултата в четим 
от човека формат (напр. „Преди 3 дни“, „Преди 1 седмица“, „Преди 2 месеца“ и т.н. ). Използвайте функцията 
strtotime(), за да преобразувате стринга за дата в Unix време и след това изчислете разликата между двете дати. 
След това използвайте поредица от оператори if, за да определите подходящата времева единица (напр. дни, 
седмици, месеци) и изведете резултата в желания формат */
$date_str = "2002-05-20";
$date_unix = strtotime($date_str);

$diff = time() - $date_unix;

if ($diff < 60) {
  $result = "Преди малко";
} elseif ($diff < 3600) {
  $result = "Преди " . round($diff / 60) . " минути";
} elseif ($diff < 86400) {
  $result = "Преди " . round($diff / 3600) . " часа";
} elseif ($diff < 604800) {
  $result = "Преди " . round($diff / 86400) . " дни";
} elseif ($diff < 2592000) {
  $result = "Преди " . round($diff / 604800) . " седмици";
} elseif ($diff < 31536000) {
  $result = "Преди " . round($diff / 2592000) . " месеца";
} else {
  $result = "Преди " . round($diff / 31104000) . " години";
}

echo $result;

?>
