<?php
/* Създайте скрипт, който изчислява броя на дните между две дати, въведени от потребителя. Използвайте 
функцията strtotime(), за да преобразувате датите в Unix timestamp и след това ги извадете, за да получите броя 
секунди между датите. Накрая разделете броя на секундите на броя секунди в деня, за да получите броя на 
дните*/

$date1 = "13.05.1992";
$date2 = "13.05.2002";

$timestamp1 = strtotime($date1);
$timestamp2 = strtotime($date2);

$seconds_diff = abs($timestamp2 - $timestamp1);

$days_diff = floor($seconds_diff / 86400);

echo "Брой дни между $date1 и $date2: $days_diff дни.";

?>
